#ifndef NXMP_I18N_RU_H
#define NXMP_I18N_RU_H

/* Default Language */
const char *ru_i18n_author = "proconsule";
bool ru_i18n_status = true;
bool ru_i18n_native = false;

const char *MainMenu_STR_RU[] = {
	"Локальные файлы",
	"USB",
	"URL-адрес потока",
	"Сеть",
	"UPNP",
	"Энигма2",
	"Плейлист",
	"Настройки",
	"Информация",
	"Выход"
};

const char *Common_STR_RU[] = {
	"Да",
	"Нет",
	"ладно",
	"Авто",
	"Навигация",
	"Выбирать",
	"Выбирать/Играть",
	"Дом",
	"Дом/Сохранять",
	"Назад",
	"Контекстное меню",
	"Имя",
	"Размер",
	"Дата",
	"Двигаться вверх",
	"Двигаться вниз",
	"Удалить",
	"Выход",
	"Отмена",
	"Сохранять",
	"Флажок",
};


const char *Popup_STR_RU[] = {
	"Сохранить настройки",
	"Возобновить игру",
	"Обновление базы данных",
	"База данных обновлена",
	"Всплывающее меню сети",
	"Всплывающее контекстное меню файла",
	"Сортировать по возрастанию (имя)",
	"Сортировать по возрастанию (размер)",
	"Сортировать по возрастанию (дата)",
	"Сортировать по убыванию (имя)",
	"Сортировать по убыванию (размер)",
	"Сортировать по убыванию (дата)",
	"Добавить файл в список воспроизведения",
	"Добавить отмеченное в плейлист",
	"Удалить элемент",
	"Очистить плейлист",
	"Установить как начальный элемент"
};

const char *SettingsMenu_STR_RU[] = {
	"Общие настройки",
	"Файловый браузер",
	"Показать скрытые файлы",
	"Навигация",
	"Включить сенсорное управление",
	"Разгон",
	"Включить разгон при запуске",
	"Разное (нужен перезапуск)",
	"VSYNC",
	"Язык интерфейса",
	"Настройки проигрывателя",
	"Декодер",
	"HW Декодер",
	"Demux Cache",
	"Demux Cache Sec",
	"Аудио",
	"Аудио выход",
	"Искать",
	"Короткий поиск",
	"Долгий поиск",
	"Язык",
	"Использовать автоматический язык аудио",
	"Язык аудио",
	"Использовать язык автоматических субтитров",
	"Язык субтитров",
	"Субтитры",
	"Sub Font Size",
	"Sub Font Scale",
	"видео",
	"Деинтерлейс видео",
	"База данных",
	"Использовать базу данных",
	"Версия базы данных:",
	"SQLite-версия:",
	"Подсчет очков для резюме:",
	"Завершенный вид:",
	"База данных не активна",
	"Начните сохранять информацию о резюме:",
	"Прекратите сохранять информацию о резюме:",
	
	"Touch Settings",
};

const char *Network_STR_RU[] = {
	"Add Share",
	"Add Share Menu",
	"Share Config",
	"Share Name:",
	"Protocol: ",
	"Credentials",
	"IP Address:",
	"Port:",
	"Username:",
	"Password:",
	"Anonymous",
	"Remote Path:",
	"Remote path on server example: /movie/",
	"Remote share on server (share not path)",
	"Test Connection",
	"Connection OK",
	"Connection Error",
	"Network Source Selection",
	"Network Source Menu",
};





#endif