#ifndef NXMP_I18N_JP_H
#define NXMP_I18N_JP_H

const char *jp_i18n_author = "mossan0101";
bool jp_i18n_status = true;
bool jp_i18n_native = true;

const char *MainMenu_STR_JP[] = {
    "ローカルファイル",
    "USB",
    "ストリーム URL",
    "ネットワーク",
    "UPNP",
    "Enigma2",
    "プレイリスト",
    "設定",
    "情報",
    "終了"
};

const char *Common_STR_JP[] = {
    "はい",
    "いいえ",
    "OK",
    "自動",
    "ナビゲーション",
    "セレクト",
    "セレクト/再生",
    "ホーム",
    "ホーム/保存",
    "もどる",
    "コンテキストメニュー",
    "名前",
    "サイズ",
    "日付時刻",
    "上に移動",
    "下に移動",
    "削除",
    "とじる",
    "キャンセル",
    "保存",
};


const char *Popup_STR_JP[] = {
    "設定を保存する",
    "再生を再開する",
    "データベースの更新",
    "データベースが更新されました",
    "ネットワークメニューポップアップ",
    "ファイルコンテキストメニューポップアップ",
    "昇順で並べ替える (名前)",
    "昇順で並べ替える (サイズ)",
    "昇順で並べ替える (日付時刻)",
    "降順で並べ替える (名前)",
    "降順で並べ替える (サイズ)",
    "降順で並べ替える (日付時刻)",
    "ファイルをプレイリストに追加",
    "選択したものをプレイリストに追加",
    "要素の削除",
    "プレイリストをクリアする",
    "開始要素として設定"
};

const char *SettingsMenu_STR_JP[] = {
    "一般設定",
    "ファイルブラウザー",
    "隠しファイルを表示する",
    "ナビゲーション",
    "タッチコントロールを有効にする",
    "オーバークロック",
    "起動時にオーバークロックを有効にする",
    "その他 (再起動が必要)",
    "VSYNC",
    "インターフェース言語",
    "プレーヤー設定",
    "デコーダー",
    "HW デコーダー",
    "Demux Cache",
    "Demux Cache Sec",
    "オーディオ",
    "オーディオ出力",
    "シーク",
    "Short シーク",
    "Long シーク",
    "言語",
    "自動で音声を切り替える",
    "音声言語",
    "自動で字幕を切り替える",
    "字幕言語",
    "字幕",
    "字幕のフォントサイズ",
    "字幕のフォントスケール",
    "ビデオ",
    "デインターレース",
    "データベース",
    "データベースを使用する",
    "データベースのバージョン:",
    "SQLite のバージョン：",
    "再開ポイント数: ",
    "完了したビュー: ",
    "データベースがアクティブではありません",
    "再開情報の保存を開始する:",
    "再開情報の保存を停止する:",
  
    "タッチ設定",
};

const char *Network_STR_JP[] = {
    "共有を追加",
    "共有メニューを追加",
    "構成を共有する",
    "共有名:",
    "プロトコル： ",
    "資格",
    "IP アドレス：",
    "ポート: ",
    "ユーザー名:",
    "パスワード：",
    "匿名",
    "リモートパス: ",
    "サーバー上のリモートパスの例: /movie/",
    "サーバー上のリモート共有 (パスではなく共有)",
    "接続テスト",
    "接続 OK",
    "接続エラー",
    "ネットワークソースの選択",
    "ネットワークソースメニュー",
};


#endif