#ifndef NXMP_I18N_KO_H
#define NXMP_I18N_KO_H

/* Default Language */
const char *ko_i18n_author = "Asadayot";
bool ko_i18n_status = true;
bool ko_i18n_native = true;

const char *MainMenu_STR_KO[] = {
	"로컬 파일",
	"USB",
	"스트리밍 URL",
	"네트워크",
	"UPnP",
	"Enigma2",
	"재생목록",
	"설정",
	"정보",
	"종료"
};

const char *Common_STR_KO[] = {
	"네",
	"아니오",
	"확인",
	"자동",
	"이동",
	"선택",
	"선택/재생",
	"홈",
	"홈/저장",
	"뒤로",
	"빠른 메뉴",
	"이름",
	"크기",
	"날짜",
	"위로 이동",
	"아래로 이동",
	"삭제",
	"나가기",
	"취소",
	"저장",
	"체크박스",
};

const char *Popup_STR_KO[] = {
	"설정 저장",
	"이어서 재생",
	"DB 갱신",
	"DB 갱신됨",
	"네트워크 메뉴",
	"파일 메뉴",
	"오름차순 정렬 (이름)",
	"오름차순 정렬 (크기)",
	"오름차순 정렬 (날짜)",
	"내림차순 정렬 (이름)",
	"내림차순 정렬 (크기)",
	"내림차순 정렬 (날짜)",
	"재생목록에 추가",
	"체크 파일을 재생목록에 추가",
	"목록에서 제거",
	"재생목록 초기화",
	"처음 재생할 영상으로 설정"
};

const char *SettingsMenu_STR_KO[] = {
	"일반 설정",
	"파일 탐색기",
	"숨김 항목 표시",
	"네비게이션",
	"터치 컨트롤 활성화",
	"오버클럭",
	"재생 시 오버클럭 활성화",
	"기타 (재시작 필요)",
	"VSYNC (수직 동기화)",
	"표시 언어 설정",
	"플레이어 설정",
	"디코더",
	"HW 디코더",
	"디멀티플렉서 캐시",
	"디멀티플렉서 캐시 Sec",
	"오디오",
	"오디오 출력",
	"스킵",
	"짧은 스킵 시간",
	"긴 스킵 시간",
	"언어 설정",
	"자동 음성 설정",
	"음성 언어",
	"자동 자막 설정",
	"자막 언어",
	"자막 설정",
	"폰트 사이즈",
	"폰트 스케일",
	"비디오",
	"디인터레이스",
	"데이터 베이스",
	"DB 사용",
	"DB 버전 :",
	"SQLite 버전 :",
	"재생한 영상: ",
	"재생 완료한 영상: ",
	"DB 비활성 상태",
	"이어서 재생 DB 저장 시작:",
	"이어서 재생 DB 저장 중지:",
	
	"터치 설정",
};

const char *Network_STR_KO[] = {
	"공유 추가",
	"공유 추가 메뉴",
	"공유 구성",
	"표시 이름:",
	"프로토콜: ",
	"자격",
	"IP 주소:",
	"포트:",
	"사용자 이름:",
	"비밀번호:",
	"익명",
	"원격 경로:",
	"서버의 원격 경로 예시: /movie/",
	"서버의 원격 공유",
	"접속 테스트",
	"접속 확인",
	"접속 에러",
	"네트워크 소스 선택",
	"네트워크 소스 메뉴",
};

#endif
